# Analyze the data for various  characteristics
Missing values, Cardinali

In [2]:
import pandas as pd
import numpy as np
df=pd.read_excel("/Users/ramu_verma/Documents/Marks.xlsx")
df

   USN Name  Marks
0    1    a     89
1    2    b     90
2    3    c     34
3    4    d     78
4    5    e     34

In [4]:
df.isnull()

     USN   Name  Marks
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [6]:
df.isnull().sum()

USN      0
Name     0
Marks    0
dtype: int64

In [8]:
df.dropna(axis=1)

   USN Name  Marks
0    1    a     89
1    2    b     90
2    3    c     34
3    4    d     78
4    5    e     34

In [10]:
df.nunique()

USN      5
Name     5
Marks    4
dtype: int64

In [12]:
df['Marks'].value_counts()

34    2
89    1
90    1
78    1
Name: Marks, dtype: int64